[Killed] BlockStatement
src/properties/properties.controller.ts:30:99
   @UseGuards(JwtAuthGuard, RolesGuard)
   @Roles('ADMIN', 'BROKER')
   @ApiBearerAuth()
-  async create(@Body() createPropertyDto: CreatePropertyRequestDto): Promise<PropertyResponseDto> {
-    const property = await this.propertiesService.createProperty(createPropertyDto);
-    return new PropertyResponseDto(property);
-  }
+  async create(@Body() createPropertyDto: CreatePropertyRequestDto): Promise<PropertyResponseDto> {}
 
   @Get()
killedBy: PropertiesController create should create a new property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"address": {"complement": "Apto 101", "number": 123, "zipCode": "12345-678"}, "area": 120.5, "offerType": "FOR_SALE", "ownerId": 1, "price": 250000, "status": "AVAILABLE"}

Number of calls: 0

[Killed] BlockStatement
src/properties/properties.controller.ts:45:30
   async findAll(
     @Paginate() query: PaginateQuery,
     @Query() filters: FilterPropertyRequestDto,
-  ): Promise<Paginated<any>> {
-    const paginatedProperties = await this.propertiesService.findAll(query, filters);
-    
-    // Transformar os itens para o DTO de resposta
-    return {
-      ...paginatedProperties,
-      data: paginatedProperties.data.map(property => new PropertyListResponseDto(property))
-    };
-  }
+  ): Promise<Paginated<any>> {}
 
   @Get(':id')
killedBy: PropertiesController findAll should return paginated properties
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"limit": 10, "page": 1, "path": "properties"}, {"maxPrice": 400000, "minPrice": 200000}

Number of calls: 0

[Killed] ArrowFunction
src/properties/properties.controller.ts:51:42
     // Transformar os itens para o DTO de resposta
     return {
       ...paginatedProperties,
-      data: paginatedProperties.data.map(property => new PropertyListResponseDto(property))
+      data: paginatedProperties.data.map(() => undefined)
     };
   }
killedBy: PropertiesController findAll should return paginated properties
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: PropertyListResponseDto

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
src/properties/properties.controller.ts:64:86
     type: PropertyResponseDto,
   })
   @ApiResponse({ status: 404, description: 'Propriedade não encontrada' })
-  async findOne(@Param('id', ParseIntPipe) id: number): Promise<PropertyResponseDto> {
-    const property = await this.propertiesService.findOne(id);
-    return new PropertyResponseDto(property);
-  }
+  async findOne(@Param('id', ParseIntPipe) id: number): Promise<PropertyResponseDto> {}
 
   @Patch(':id')
killedBy: PropertiesController findOne should return a property when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/properties/properties.controller.ts:84:35
   async update(
     @Param('id', ParseIntPipe) id: number,
     @Body() updatePropertyDto: UpdatePropertyRequestDto,
-  ): Promise<PropertyResponseDto> {
-    const property = await this.propertiesService.update(id, updatePropertyDto);
-    return new PropertyResponseDto(property);
-  }
+  ): Promise<PropertyResponseDto> {}
 
   @Delete(':id')
killedBy: PropertiesController update should update and return a property when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, {"price": 300000, "status": "CONCLUDED"}

Number of calls: 0

[Killed] BlockStatement
src/properties/properties.controller.ts:98:70
   @UseGuards(JwtAuthGuard, RolesGuard)
   @Roles('ADMIN', 'BROKER')
   @ApiBearerAuth()
-  async remove(@Param('id', ParseIntPipe) id: number): Promise<void> {
-    await this.propertiesService.remove(id);
-  }
+  async remove(@Param('id', ParseIntPipe) id: number): Promise<void> {}
 }
 
killedBy: PropertiesController remove should remove a property successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0
