[Killed] BlockStatement
src/properties/properties.service.ts:24:88
     private readonly ownersService: OwnersService
   ) {}
 
-  async createProperty(createPropertyDto: CreatePropertyRequestDto): Promise<Property> {
-    const owner = await this.ownersService.findOne(createPropertyDto.ownerId);
-    
-    const addressData = await this.getAddressByCep(createPropertyDto.address.zipCode);
-    
-    const property = this.propertiesRepository.create({
-      ...createPropertyDto,
-      owner,
-      address: {
-        ...addressData,
-        number: createPropertyDto.address.number,
-        complement: createPropertyDto.address.complement
-      }
-    });
-
-    return this.propertiesRepository.save(property);
-  }
+  async createProperty(createPropertyDto: CreatePropertyRequestDto): Promise<Property> {}
 
   async findAll(query: PaginateQuery, filters?: FilterPropertyRequestDto): Promise<Paginated<Property>> {
killedBy: PropertiesService createProperty should create a new property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] StringLiteral
src/properties/properties.service.ts:45:26
   async findAll(query: PaginateQuery, filters?: FilterPropertyRequestDto): Promise<Paginated<Property>> {
     const queryBuilder = this.propertiesRepository.createQueryBuilder('property')
       .leftJoinAndSelect('property.owner', 'owner')
-      .leftJoinAndSelect('property.features', 'features')
+      .leftJoinAndSelect("", 'features')
       .leftJoinAndSelect('property.images', 'images');
 
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "property.features", "features"
Received
       1: "property.owner", "owner"
       2: "", "features"
       3: "property.images", "images"

[Killed] ConditionalExpression
src/properties/properties.service.ts:48:9
       .leftJoinAndSelect('property.features', 'features')
       .leftJoinAndSelect('property.images', 'images');
 
-    if (filters?.minPrice) {
+    if (true) {
       queryBuilder.andWhere('property.price >= :minPrice', { minPrice: filters.minPrice });
     }
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: TypeError: Cannot read properties of undefined (reading 'minPrice')

[Killed] BlockStatement
src/properties/properties.service.ts:48:28
       .leftJoinAndSelect('property.features', 'features')
       .leftJoinAndSelect('property.images', 'images');
 
-    if (filters?.minPrice) {
-      queryBuilder.andWhere('property.price >= :minPrice', { minPrice: filters.minPrice });
-    }
+    if (filters?.minPrice) {}
     
     if (filters?.maxPrice) {
killedBy: PropertiesService findAll should apply filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "property.price >= :minPrice", {"minPrice": 200000}
Received
       1
          "property.price <= :maxPrice",
          Object {
        -   "minPrice": 200000,

[Killed] ConditionalExpression
src/properties/properties.service.ts:52:9
       queryBuilder.andWhere('property.price >= :minPrice', { minPrice: filters.minPrice });
     }
     
-    if (filters?.maxPrice) {
+    if (false) {
       queryBuilder.andWhere('property.price <= :maxPrice', { maxPrice: filters.maxPrice });
     }
killedBy: PropertiesService findAll should apply filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "property.price <= :maxPrice", {"maxPrice": 300000}
Received
       1
          "property.price >= :minPrice",
          Object {
        -   "maxPrice": 300000,

[Killed] ConditionalExpression
src/properties/properties.service.ts:52:9
       queryBuilder.andWhere('property.price >= :minPrice', { minPrice: filters.minPrice });
     }
     
-    if (filters?.maxPrice) {
+    if (true) {
       queryBuilder.andWhere('property.price <= :maxPrice', { maxPrice: filters.maxPrice });
     }
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: TypeError: Cannot read properties of undefined (reading 'maxPrice')

[Killed] BlockStatement
src/properties/properties.service.ts:56:27
       queryBuilder.andWhere('property.price <= :maxPrice', { maxPrice: filters.maxPrice });
     }
     
-    if (filters?.minArea) {
-      queryBuilder.andWhere('property.area >= :minArea', { minArea: filters.minArea });
-    }
+    if (filters?.minArea) {}
     
     if (filters?.maxArea) {
killedBy: PropertiesService findAll should apply filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "property.area >= :minArea", {"minArea": 100}
Received
       1
          "property.price >= :minPrice",
          Object {
        -   "minArea": 100,

[Killed] ConditionalExpression
src/properties/properties.service.ts:56:9
       queryBuilder.andWhere('property.price <= :maxPrice', { maxPrice: filters.maxPrice });
     }
     
-    if (filters?.minArea) {
+    if (true) {
       queryBuilder.andWhere('property.area >= :minArea', { minArea: filters.minArea });
     }
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: TypeError: Cannot read properties of undefined (reading 'minArea')

[Killed] StringLiteral
src/properties/properties.service.ts:57:29
     }
     
     if (filters?.minArea) {
-      queryBuilder.andWhere('property.area >= :minArea', { minArea: filters.minArea });
+      queryBuilder.andWhere("", { minArea: filters.minArea });
     }
     
killedBy: PropertiesService findAll should apply filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "property.area >= :minArea", {"minArea": 100}
Received
       1
          "property.price >= :minPrice",
          Object {
        -   "minArea": 100,

[Killed] BlockStatement
src/properties/properties.service.ts:60:27
       queryBuilder.andWhere('property.area >= :minArea', { minArea: filters.minArea });
     }
     
-    if (filters?.maxArea) {
-      queryBuilder.andWhere('property.area <= :maxArea', { maxArea: filters.maxArea });
-    }
+    if (filters?.maxArea) {}
 
     return paginate(query, queryBuilder, {
killedBy: PropertiesService findAll should apply filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "property.area <= :maxArea", {"maxArea": 150}
Received
       1
          "property.price >= :minPrice",
          Object {
        -   "maxArea": 150,

[Killed] ConditionalExpression
src/properties/properties.service.ts:60:9
       queryBuilder.andWhere('property.area >= :minArea', { minArea: filters.minArea });
     }
     
-    if (filters?.maxArea) {
+    if (false) {
       queryBuilder.andWhere('property.area <= :maxArea', { maxArea: filters.maxArea });
     }
killedBy: PropertiesService findAll should apply filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "property.area <= :maxArea", {"maxArea": 150}
Received
       1
          "property.price >= :minPrice",
          Object {
        -   "maxArea": 150,

[Killed] StringLiteral
src/properties/properties.service.ts:65:39
     }
 
     return paginate(query, queryBuilder, {
-      sortableColumns: ['propertyId', 'price', 'area', 'registrationDate'],
+      sortableColumns: ['propertyId', "", 'area', 'registrationDate'],
       defaultSortBy: [['propertyId', 'DESC']],
       searchableColumns: ['address.city', 'address.neighborhood'],
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"limit": 10, "page": 1, "path": ""},
  {"andWhere": [Function mockConstructor], "getCount": [Function mockConstructor], "getMany": [Function mockConstructor], "leftJoinAndSelect": [Function mockConstructor], "skip": [Function mockConstructor], "take": [Function mockConstructor]},
@@ -27,10 +27,10 @@

[Killed] ArrayDeclaration
src/properties/properties.service.ts:65:24
     }
 
     return paginate(query, queryBuilder, {
-      sortableColumns: ['propertyId', 'price', 'area', 'registrationDate'],
+      sortableColumns: [],
       defaultSortBy: [['propertyId', 'DESC']],
       searchableColumns: ['address.city', 'address.neighborhood'],
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"limit": 10, "page": 1, "path": ""},
  {"andWhere": [Function mockConstructor], "getCount": [Function mockConstructor], "getMany": [Function mockConstructor], "leftJoinAndSelect": [Function mockConstructor], "skip": [Function mockConstructor], "take": [Function mockConstructor]},
@@ -25,12 +25,7 @@

[Killed] StringLiteral
src/properties/properties.service.ts:66:38
 
     return paginate(query, queryBuilder, {
       sortableColumns: ['propertyId', 'price', 'area', 'registrationDate'],
-      defaultSortBy: [['propertyId', 'DESC']],
+      defaultSortBy: [['propertyId', ""]],
       searchableColumns: ['address.city', 'address.neighborhood'],
       select: ['propertyId', 'price', 'area', 'status', 'offerType'],
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"limit": 10, "page": 1, "path": ""},
  {"andWhere": [Function mockConstructor], "getCount": [Function mockConstructor], "getMany": [Function mockConstructor], "leftJoinAndSelect": [Function mockConstructor], "skip": [Function mockConstructor], "take": [Function mockConstructor]},
@@ -1,10 +1,10 @@

[Killed] StringLiteral
src/properties/properties.service.ts:66:24
 
     return paginate(query, queryBuilder, {
       sortableColumns: ['propertyId', 'price', 'area', 'registrationDate'],
-      defaultSortBy: [['propertyId', 'DESC']],
+      defaultSortBy: [["", 'DESC']],
       searchableColumns: ['address.city', 'address.neighborhood'],
       select: ['propertyId', 'price', 'area', 'status', 'offerType'],
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"limit": 10, "page": 1, "path": ""},
  {"andWhere": [Function mockConstructor], "getCount": [Function mockConstructor], "getMany": [Function mockConstructor], "leftJoinAndSelect": [Function mockConstructor], "skip": [Function mockConstructor], "take": [Function mockConstructor]},
@@ -1,9 +1,9 @@

[Killed] StringLiteral
src/properties/properties.service.ts:67:27
     return paginate(query, queryBuilder, {
       sortableColumns: ['propertyId', 'price', 'area', 'registrationDate'],
       defaultSortBy: [['propertyId', 'DESC']],
-      searchableColumns: ['address.city', 'address.neighborhood'],
+      searchableColumns: ["", 'address.neighborhood'],
       select: ['propertyId', 'price', 'area', 'status', 'offerType'],
       filterableColumns: {
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"limit": 10, "page": 1, "path": ""},
  {"andWhere": [Function mockConstructor], "getCount": [Function mockConstructor], "getMany": [Function mockConstructor], "leftJoinAndSelect": [Function mockConstructor], "skip": [Function mockConstructor], "take": [Function mockConstructor]},
@@ -15,11 +15,11 @@

[Killed] StringLiteral
src/properties/properties.service.ts:68:39
       sortableColumns: ['propertyId', 'price', 'area', 'registrationDate'],
       defaultSortBy: [['propertyId', 'DESC']],
       searchableColumns: ['address.city', 'address.neighborhood'],
-      select: ['propertyId', 'price', 'area', 'status', 'offerType'],
+      select: ['propertyId', 'price', "", 'status', 'offerType'],
       filterableColumns: {
         status: [FilterOperator.EQ],
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"limit": 10, "page": 1, "path": ""},
  {"andWhere": [Function mockConstructor], "getCount": [Function mockConstructor], "getMany": [Function mockConstructor], "leftJoinAndSelect": [Function mockConstructor], "skip": [Function mockConstructor], "take": [Function mockConstructor]},
@@ -21,11 +21,11 @@

[Killed] StringLiteral
src/properties/properties.service.ts:68:47
       sortableColumns: ['propertyId', 'price', 'area', 'registrationDate'],
       defaultSortBy: [['propertyId', 'DESC']],
       searchableColumns: ['address.city', 'address.neighborhood'],
-      select: ['propertyId', 'price', 'area', 'status', 'offerType'],
+      select: ['propertyId', 'price', 'area', "", 'offerType'],
       filterableColumns: {
         status: [FilterOperator.EQ],
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"limit": 10, "page": 1, "path": ""},
  {"andWhere": [Function mockConstructor], "getCount": [Function mockConstructor], "getMany": [Function mockConstructor], "leftJoinAndSelect": [Function mockConstructor], "skip": [Function mockConstructor], "take": [Function mockConstructor]},
@@ -22,11 +22,11 @@

[Killed] ArrayDeclaration
src/properties/properties.service.ts:70:17
       searchableColumns: ['address.city', 'address.neighborhood'],
       select: ['propertyId', 'price', 'area', 'status', 'offerType'],
       filterableColumns: {
-        status: [FilterOperator.EQ],
+        status: [],
         offerType: [FilterOperator.EQ],
         'owner.ownerId': [FilterOperator.EQ],
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"limit": 10, "page": 1, "path": ""},
  {"andWhere": [Function mockConstructor], "getCount": [Function mockConstructor], "getMany": [Function mockConstructor], "leftJoinAndSelect": [Function mockConstructor], "skip": [Function mockConstructor], "take": [Function mockConstructor]},
@@ -10,13 +10,11 @@

[Killed] ArrayDeclaration
src/properties/properties.service.ts:71:20
       select: ['propertyId', 'price', 'area', 'status', 'offerType'],
       filterableColumns: {
         status: [FilterOperator.EQ],
-        offerType: [FilterOperator.EQ],
+        offerType: [],
         'owner.ownerId': [FilterOperator.EQ],
       },
killedBy: PropertiesService findAll should return paginated properties without filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"limit": 10, "page": 1, "path": ""},
  {"andWhere": [Function mockConstructor], "getCount": [Function mockConstructor], "getMany": [Function mockConstructor], "leftJoinAndSelect": [Function mockConstructor], "skip": [Function mockConstructor], "take": [Function mockConstructor]},
@@ -4,13 +4,11 @@

[Killed] BlockStatement
src/properties/properties.service.ts:77:48
     });
   }
 
-  async findOne(id: number): Promise<Property> {
-    const property = await this.propertiesRepository.findOne({
-      where: { propertyId: id },
-      relations: ['owner', 'features', 'features.featureType', 'images']
-    });
-
-    if (!property) {
-      throw new NotFoundException(`Propriedade com ID ${id} não encontrada`);
-    }
-
-    return property;
-  }
+  async findOne(id: number): Promise<Property> {}
 
   async update(id: number, updatePropertyDto: UpdatePropertyRequestDto): Promise<Property> {
killedBy: PropertiesService findOne should return a property when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"relations": ["owner", "features", "features.featureType", "images"], "where": {"propertyId": 1}}

Number of calls: 0

[Killed] ConditionalExpression
src/properties/properties.service.ts:83:9
       relations: ['owner', 'features', 'features.featureType', 'images']
     });
 
-    if (!property) {
+    if (true) {
       throw new NotFoundException(`Propriedade com ID ${id} não encontrada`);
     }
killedBy: PropertiesService findOne should return a property when it exists
statusReason: NotFoundException: Propriedade com ID 1 não encontrada

[Killed] BlockStatement
src/properties/properties.service.ts:83:20
       relations: ['owner', 'features', 'features.featureType', 'images']
     });
 
-    if (!property) {
-      throw new NotFoundException(`Propriedade com ID ${id} não encontrada`);
-    }
+    if (!property) {}
 
     return property;
killedBy: PropertiesService findOne should throw NotFoundException when property does not exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] ConditionalExpression
src/properties/properties.service.ts:93:9
   async update(id: number, updatePropertyDto: UpdatePropertyRequestDto): Promise<Property> {
     const property = await this.findOne(id);
     
-    if (updatePropertyDto.ownerId) {
+    if (false) {
       const owner = await this.ownersService.findOne(updatePropertyDto.ownerId);
       property.owner = owner;
killedBy: PropertiesService update should update owner when ownerId is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 2

Number of calls: 0

[Killed] BlockStatement
src/properties/properties.service.ts:93:36
   async update(id: number, updatePropertyDto: UpdatePropertyRequestDto): Promise<Property> {
     const property = await this.findOne(id);
     
-    if (updatePropertyDto.ownerId) {
-      const owner = await this.ownersService.findOne(updatePropertyDto.ownerId);
-      property.owner = owner;
-    }
+    if (updatePropertyDto.ownerId) {}
     
     // Se houver atualização do endereço, processar as informações
killedBy: PropertiesService update should update owner when ownerId is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 2

Number of calls: 0

[Killed] ConditionalExpression
src/properties/properties.service.ts:99:9
     }
     
     // Se houver atualização do endereço, processar as informações
-    if (updatePropertyDto.address) {
+    if (true) {
       const addressData = await this.getAddressByCep(updatePropertyDto.address.zipCode);
       property.address = {
killedBy: PropertiesService update should update a property when it exists
statusReason: TypeError: Cannot read properties of undefined (reading 'zipCode')

[Killed] ConditionalExpression
src/properties/properties.service.ts:99:9
     }
     
     // Se houver atualização do endereço, processar as informações
-    if (updatePropertyDto.address) {
+    if (false) {
       const addressData = await this.getAddressByCep(updatePropertyDto.address.zipCode);
       property.address = {
killedBy: PropertiesService update should update address when address is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "12345-678"

Number of calls: 0

[Killed] BlockStatement
src/properties/properties.service.ts:109:48
     }
     
     // Atualizar os outros campos
-    if (updatePropertyDto.price !== undefined) {
-      property.price = updatePropertyDto.price;
-    }
+    if (updatePropertyDto.price !== undefined) {}
     
     if (updatePropertyDto.status !== undefined) {
killedBy: PropertiesService update should update a property when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"price": 300000, "propertyId": 1, "status": "CONCLUDED"}
Received: {"address": {}, "features": [], "images": [], "owner": {}, "price": 250000, "propertyId": 1, "status": "CONCLUDED"}

Number of calls: 1

[Killed] EqualityOperator
src/properties/properties.service.ts:109:9
     }
     
     // Atualizar os outros campos
-    if (updatePropertyDto.price !== undefined) {
+    if (updatePropertyDto.price === undefined) {
       property.price = updatePropertyDto.price;
     }
killedBy: PropertiesService update should update a property when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"price": 300000, "propertyId": 1, "status": "CONCLUDED"}
Received: {"address": {}, "features": [], "images": [], "owner": {}, "price": 250000, "propertyId": 1, "status": "CONCLUDED"}

Number of calls: 1

[Killed] ConditionalExpression
src/properties/properties.service.ts:113:9
       property.price = updatePropertyDto.price;
     }
     
-    if (updatePropertyDto.status !== undefined) {
+    if (false) {
       property.status = updatePropertyDto.status;
     }
killedBy: PropertiesService update should update a property when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"price": 300000, "propertyId": 1, "status": "CONCLUDED"}
Received: {"address": {}, "features": [], "images": [], "owner": {}, "price": 300000, "propertyId": 1, "status": "AVAILABLE"}

Number of calls: 1

[Killed] ConditionalExpression
src/properties/properties.service.ts:113:9
       property.price = updatePropertyDto.price;
     }
     
-    if (updatePropertyDto.status !== undefined) {
+    if (true) {
       property.status = updatePropertyDto.status;
     }
killedBy: PropertiesService update should not update status when status is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"price": 300000, "status": "AVAILABLE"}
Received: {"features": [], "images": [], "price": 300000, "propertyId": 1, "status": undefined}

Number of calls: 1

[Killed] EqualityOperator
src/properties/properties.service.ts:117:9
       property.status = updatePropertyDto.status;
     }
     
-    if (updatePropertyDto.offerType !== undefined) {
+    if (updatePropertyDto.offerType === undefined) {
       property.offerType = updatePropertyDto.offerType;
     }
killedBy: PropertiesService update should update offerType when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"offerType": "FOR_RENTAL", "propertyId": 1}
Received: {"address": {}, "area": 120, "features": [], "images": [], "offerType": "FOR_SALE", "owner": {}, "price": 250000, "propertyId": 1, "status": "AVAILABLE"}

Number of calls: 1

[Killed] BlockStatement
src/properties/properties.service.ts:117:52
       property.status = updatePropertyDto.status;
     }
     
-    if (updatePropertyDto.offerType !== undefined) {
-      property.offerType = updatePropertyDto.offerType;
-    }
+    if (updatePropertyDto.offerType !== undefined) {}
     
     if (updatePropertyDto.area !== undefined) {
killedBy: PropertiesService update should update offerType when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"offerType": "FOR_RENTAL", "propertyId": 1}
Received: {"address": {}, "area": 120, "features": [], "images": [], "offerType": "FOR_SALE", "owner": {}, "price": 250000, "propertyId": 1, "status": "AVAILABLE"}

Number of calls: 1

[Killed] ConditionalExpression
src/properties/properties.service.ts:121:9
       property.offerType = updatePropertyDto.offerType;
     }
     
-    if (updatePropertyDto.area !== undefined) {
+    if (true) {
       property.area = updatePropertyDto.area;
     }
killedBy: PropertiesService update should not update area when area is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"area": 120.5, "price": 300000}
Received: {"area": undefined, "features": [], "images": [], "price": 300000, "propertyId": 1}

Number of calls: 1

[Killed] EqualityOperator
src/properties/properties.service.ts:121:9
       property.offerType = updatePropertyDto.offerType;
     }
     
-    if (updatePropertyDto.area !== undefined) {
+    if (updatePropertyDto.area === undefined) {
       property.area = updatePropertyDto.area;
     }
killedBy: PropertiesService update should update area when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"area": 150.5, "propertyId": 1}
Received: {"address": {}, "area": 120, "features": [], "images": [], "offerType": "FOR_SALE", "owner": {}, "price": 250000, "propertyId": 1, "status": "AVAILABLE"}

Number of calls: 1

[Killed] BlockStatement
src/properties/properties.service.ts:129:43
     return this.propertiesRepository.save(property);
   }
 
-  async remove(id: number): Promise<void> {
-    const result = await this.propertiesRepository.delete(id);
-    
-    if (result.affected === 0) {
-      throw new NotFoundException(`Propriedade com ID ${id} não encontrada`);
-    }
-  }
+  async remove(id: number): Promise<void> {}
 
   private async getAddressByCep(cep: string): Promise<Address> {
killedBy: PropertiesService remove should remove a property when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/properties/properties.service.ts:132:32
   async remove(id: number): Promise<void> {
     const result = await this.propertiesRepository.delete(id);
     
-    if (result.affected === 0) {
-      throw new NotFoundException(`Propriedade com ID ${id} não encontrada`);
-    }
+    if (result.affected === 0) {}
   }
 
killedBy: PropertiesService remove should throw NotFoundException when property does not exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] Regex
src/properties/properties.service.ts:138:38
   }
 
   private async getAddressByCep(cep: string): Promise<Address> {
-    const formattedCep = cep.replace(/\D/g, '');
+    const formattedCep = cep.replace(/\d/g, '');
     const url = `https://viacep.com.br/ws/${formattedCep}/json/`;
     
killedBy: PropertiesService getAddressByCep should return address data when CEP is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://viacep.com.br/ws/12345678/json/"
Received: "https://viacep.com.br/ws/-/json/"

Number of calls: 1

[Killed] StringLiteral
src/properties/properties.service.ts:139:17
 
   private async getAddressByCep(cep: string): Promise<Address> {
     const formattedCep = cep.replace(/\D/g, '');
-    const url = `https://viacep.com.br/ws/${formattedCep}/json/`;
+    const url = ``;
     
     try {
killedBy: PropertiesService getAddressByCep should return address data when CEP is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://viacep.com.br/ws/12345678/json/"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/properties/properties.service.ts:141:9
     const formattedCep = cep.replace(/\D/g, '');
     const url = `https://viacep.com.br/ws/${formattedCep}/json/`;
     
-    try {
-      const response: AxiosResponse<any> = await firstValueFrom(this.httpService.get(url));
-      
-      if (response.data?.erro) {
-        throw new BadRequestException('CEP não encontrado.');
-      }
-      
-      const address = new Address();
-      address.zipCode = cep;
-      address.street = response.data.logradouro;
-      address.neighborhood = response.data.bairro;
-      address.city = response.data.localidade;
-      address.state = response.data.uf;
-      
-      return address;
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof BadRequestException) {
         throw error;
killedBy: PropertiesService getAddressByCep should return address data when CEP is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://viacep.com.br/ws/12345678/json/"

Number of calls: 0

[Killed] BlockStatement
src/properties/properties.service.ts:144:32
     try {
       const response: AxiosResponse<any> = await firstValueFrom(this.httpService.get(url));
       
-      if (response.data?.erro) {
-        throw new BadRequestException('CEP não encontrado.');
-      }
+      if (response.data?.erro) {}
       
       const address = new Address();
killedBy: PropertiesService getAddressByCep should throw BadRequestException when CEP is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"city": undefined, "complement": undefined, "neighborhood": undefined, "number": undefined, "state": undefined, "street": undefined, "zipCode": "00000-000"}

[Killed] ConditionalExpression
src/properties/properties.service.ts:144:11
     try {
       const response: AxiosResponse<any> = await firstValueFrom(this.httpService.get(url));
       
-      if (response.data?.erro) {
+      if (false) {
         throw new BadRequestException('CEP não encontrado.');
       }
killedBy: PropertiesService getAddressByCep should throw BadRequestException when CEP is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"city": undefined, "complement": undefined, "neighborhood": undefined, "number": undefined, "state": undefined, "street": undefined, "zipCode": "00000-000"}
