[Killed] BlockStatement
src/properties/properties.service.ts:156:21
       address.state = response.data.uf;
       
       return address;
-    } catch (error) {
-      if (error instanceof BadRequestException) {
-        throw error;
-      }
-      throw new ServiceUnavailableException('Serviço ViaCep indisponível no momento.');
-    }
+    } catch (error) {}
   }
 }
killedBy: PropertiesService getAddressByCep should throw BadRequestException when CEP is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/properties/properties.service.ts:157:11
       
       return address;
     } catch (error) {
-      if (error instanceof BadRequestException) {
+      if (false) {
         throw error;
       }
killedBy: PropertiesService getAddressByCep should throw BadRequestException when CEP is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: BadRequestException
Received constructor: ServiceUnavailableException

Received message: "Serviço ViaCep indisponível no momento."

      290 |             }

[Killed] BlockStatement
src/properties/properties.service.ts:157:49
       
       return address;
     } catch (error) {
-      if (error instanceof BadRequestException) {
-        throw error;
-      }
+      if (error instanceof BadRequestException) {}
       throw new ServiceUnavailableException('Serviço ViaCep indisponível no momento.');
     }
killedBy: PropertiesService getAddressByCep should throw BadRequestException when CEP is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: BadRequestException
Received constructor: ServiceUnavailableException

Received message: "Serviço ViaCep indisponível no momento."

      290 |             }
