[Killed] BlockStatement
src/app.service.ts:5:32
 
 @Injectable()
 export class AppService {
-  getDefaultResponse(): string {
-    return 'healthy';
-  }
+  getDefaultResponse(): string {}
 }
 
killedBy: AppService getDefaultResponse should return "healthy"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "healthy"
Received: undefined
