[Killed] BlockStatement
src/feature-types/feature-types.controller.ts:26:101
   })
   @ApiResponse({ status: 400, description: 'Dados inválidos' })
   @Roles('ADMIN')
-  async create(@Body() createFeatureTypeDto: CreateFeatureTypeDto): Promise<FeatureTypeResponseDto> {
-    const featureType = await this.featureTypesService.create(createFeatureTypeDto);
-    return new FeatureTypeResponseDto(featureType);
-  }
+  async create(@Body() createFeatureTypeDto: CreateFeatureTypeDto): Promise<FeatureTypeResponseDto> {}
 
   @Get()
killedBy: FeatureTypesController create should create a new feature type
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"allowsQuantity": true, "name": "Quartos", "unit": "un"}

Number of calls: 0

[Killed] BlockStatement
src/feature-types/feature-types.controller.ts:39:54
     type: [FeatureTypeResponseDto],
   })
   @Roles('ADMIN')
-  async findAll(): Promise<FeatureTypeResponseDto[]> {
-    const featureTypes = await this.featureTypesService.findAll();
-    return featureTypes.map(featureType => new FeatureTypeResponseDto(featureType));
-  }
+  async findAll(): Promise<FeatureTypeResponseDto[]> {}
 
   @Get(':id')
killedBy: FeatureTypesController findAll should return an array of feature types
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrowFunction
src/feature-types/feature-types.controller.ts:41:29
   @Roles('ADMIN')
   async findAll(): Promise<FeatureTypeResponseDto[]> {
     const featureTypes = await this.featureTypesService.findAll();
-    return featureTypes.map(featureType => new FeatureTypeResponseDto(featureType));
+    return featureTypes.map(() => undefined);
   }
 
killedBy: FeatureTypesController findAll should return an array of feature types
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ObjectContaining {"featureId": 1, "name": "Quartos"}
Received: undefined

[Killed] BlockStatement
src/feature-types/feature-types.controller.ts:54:89
   })
   @ApiResponse({ status: 404, description: 'Tipo de característica não encontrado' })
   @Roles('ADMIN')
-  async findOne(@Param('id', ParseIntPipe) id: number): Promise<FeatureTypeResponseDto> {
-    const featureType = await this.featureTypesService.findOne(id);
-    return new FeatureTypeResponseDto(featureType);
-  }
+  async findOne(@Param('id', ParseIntPipe) id: number): Promise<FeatureTypeResponseDto> {}
 
   @Patch(':id')
killedBy: FeatureTypesController findOne should return a feature type when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/feature-types/feature-types.controller.ts:72:38
   async update(
     @Param('id', ParseIntPipe) id: number,
     @Body() updateFeatureTypeDto: UpdateFeatureTypeDto,
-  ): Promise<FeatureTypeResponseDto> {
-    const featureType = await this.featureTypesService.update(id, updateFeatureTypeDto);
-    return new FeatureTypeResponseDto(featureType);
-  }
+  ): Promise<FeatureTypeResponseDto> {}
 
   @Delete(':id')
killedBy: FeatureTypesController update should update a feature type when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, {"name": "Quartos Atualizados"}

Number of calls: 0

[Killed] BlockStatement
src/feature-types/feature-types.controller.ts:84:70
   @ApiResponse({ status: 204, description: 'Tipo de característica removido com sucesso' })
   @ApiResponse({ status: 404, description: 'Tipo de característica não encontrado' })
   @Roles('ADMIN')
-  async remove(@Param('id', ParseIntPipe) id: number): Promise<void> {
-    await this.featureTypesService.remove(id);
-  }
+  async remove(@Param('id', ParseIntPipe) id: number): Promise<void> {}
 }
 
killedBy: FeatureTypesController remove should remove a feature type when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0
