[Killed] BlockStatement
src/app.controller.ts:9:37
   constructor(private readonly appService: AppService) {}
 
   @Get('health')
-  healthCheck(): { status: string } {
-    return { status: this.appService.getDefaultResponse() };
-  }
+  healthCheck(): { status: string } {}
 }
killedBy: AppController healthCheck should return health status
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"status": "healthy"}
Received: undefined

[Killed] ObjectLiteral
src/app.controller.ts:10:12
 
   @Get('health')
   healthCheck(): { status: string } {
-    return { status: this.appService.getDefaultResponse() };
+    return {};
   }
 }
killedBy: AppController healthCheck should return health status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "healthy",
- }
