[Killed] BlockStatement
src/feature-types/feature-types.service.ts:15:82
     private featureTypeRepository: Repository<FeatureType>,
   ) {}
 
-  async create(createFeatureTypeDto: CreateFeatureTypeDto): Promise<FeatureType> {
-    const featureType = this.featureTypeRepository.create(createFeatureTypeDto);
-    return this.featureTypeRepository.save(featureType);
-  }
+  async create(createFeatureTypeDto: CreateFeatureTypeDto): Promise<FeatureType> {}
 
   async findAll(): Promise<FeatureType[]> {
killedBy: FeatureTypesService create should create a new feature type
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"allowsQuantity": true, "name": "Test Feature Type"}

Number of calls: 0

[Killed] BlockStatement
src/feature-types/feature-types.service.ts:20:43
     return this.featureTypeRepository.save(featureType);
   }
 
-  async findAll(): Promise<FeatureType[]> {
-    return this.featureTypeRepository.find();
-  }
+  async findAll(): Promise<FeatureType[]> {}
 
   async findOne(id: number): Promise<FeatureType> {
killedBy: FeatureTypesService findAll should return an array of feature types
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/feature-types/feature-types.service.ts:24:51
     return this.featureTypeRepository.find();
   }
 
-  async findOne(id: number): Promise<FeatureType> {
-    const featureType = await this.featureTypeRepository.findOne({ 
-      where: { featureId: id } 
-    });
-    
-    if (!featureType) {
-      throw new NotFoundException(`Tipo de característica com ID ${id} não encontrado`);
-    }
-    
-    return featureType;
-  }
+  async findOne(id: number): Promise<FeatureType> {}
 
   async update(id: number, updateFeatureTypeDto: UpdateFeatureTypeDto): Promise<FeatureType> {
killedBy: FeatureTypesService findOne should return a feature type when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"featureId": 1}}

Number of calls: 0

[Killed] BlockStatement
src/feature-types/feature-types.service.ts:29:23
       where: { featureId: id } 
     });
     
-    if (!featureType) {
-      throw new NotFoundException(`Tipo de característica com ID ${id} não encontrado`);
-    }
+    if (!featureType) {}
     
     return featureType;
killedBy: FeatureTypesService findOne should throw NotFoundException when feature type does not exist
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: NotFoundException
Received constructor: ReferenceError

[Killed] BooleanLiteral
src/feature-types/feature-types.service.ts:29:9
       where: { featureId: id } 
     });
     
-    if (!featureType) {
+    if (featureType) {
       throw new NotFoundException(`Tipo de característica com ID ${id} não encontrado`);
     }
killedBy: FeatureTypesService findOne should return a feature type when it exists
statusReason: NotFoundException: Tipo de característica com ID 1 não encontrado

[Killed] BlockStatement
src/feature-types/feature-types.service.ts:36:94
     return featureType;
   }
 
-  async update(id: number, updateFeatureTypeDto: UpdateFeatureTypeDto): Promise<FeatureType> {
-    const featureType = await this.findOne(id);
-    
-    Object.assign(featureType, updateFeatureTypeDto);
-    
-    return this.featureTypeRepository.save(featureType);
-  }
+  async update(id: number, updateFeatureTypeDto: UpdateFeatureTypeDto): Promise<FeatureType> {}
 
   async remove(id: number): Promise<void> {
killedBy: FeatureTypesService update should update a feature type when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/feature-types/feature-types.service.ts:44:43
     return this.featureTypeRepository.save(featureType);
   }
 
-  async remove(id: number): Promise<void> {
-    const result = await this.featureTypeRepository.delete(id);
-    
-    if (result.affected === 0) {
-      throw new NotFoundException(`Tipo de característica com ID ${id} não encontrado`);
-    }
-  }
+  async remove(id: number): Promise<void> {}
 }
 
killedBy: FeatureTypesService remove should remove a feature type when it exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ConditionalExpression
src/feature-types/feature-types.service.ts:47:9
   async remove(id: number): Promise<void> {
     const result = await this.featureTypeRepository.delete(id);
     
-    if (result.affected === 0) {
+    if (true) {
       throw new NotFoundException(`Tipo de característica com ID ${id} não encontrado`);
     }
killedBy: FeatureTypesService remove should remove a feature type when it exists
statusReason: NotFoundException: Tipo de característica com ID 1 não encontrado
