[Killed] BlockStatement
src/owners/owners.controller.ts:24:72
   @Roles('ADMIN', 'BROKER')
   @SkipResourceOwnerCheck()
   @ApiBody({ type: CreateOwnerDto })
-  async create(@Body() createOwnerDto: CreateOwnerDto): Promise<Owner> {
-    return this.ownersService.createOwner(createOwnerDto);
-  }
+  async create(@Body() createOwnerDto: CreateOwnerDto): Promise<Owner> {}
 
   @Get()
killedBy: OwnersController create should create a new owner
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"contactPhone": "(11) 99999-9999", "cpf": "12345678901", "name": "João Silva"}

Number of calls: 0

[Killed] BlockStatement
src/owners/owners.controller.ts:33:37
   @ApiResponse({ status: 200, description: 'Lista de proprietários', type: [Owner] })
   @Roles('ADMIN', 'BROKER')
   @SkipResourceOwnerCheck()
-  async findAll(): Promise<Owner[]> {
-    return this.ownersService.findAll();
-  }
+  async findAll(): Promise<Owner[]> {}
 
   @Get(':id')
killedBy: OwnersController findAll should return all owners
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/owners/owners.controller.ts:44:58
   @ApiResponse({ status: 404, description: 'Proprietário não encontrado' })
   @Roles('ADMIN', 'BROKER')
   @SkipResourceOwnerCheck()
-  async findOne(@Param('id') id: number): Promise<Owner> {
-    return this.ownersService.findOne(id);
-  }
+  async findOne(@Param('id') id: number): Promise<Owner> {}
 
   @Get('cpf/:cpf')
killedBy: OwnersController findOne should return owner by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/owners/owners.controller.ts:55:62
   @ApiResponse({ status: 404, description: 'Proprietário não encontrado' })
   @Roles('ADMIN', 'BROKER')
   @SkipResourceOwnerCheck()
-  async findByCpf(@Param('cpf') cpf: string): Promise<Owner> {
-    return this.ownersService.findByCpf(cpf);
-  }
+  async findByCpf(@Param('cpf') cpf: string): Promise<Owner> {}
 
   @Put(':id')
killedBy: OwnersController findByCpf should return owner by CPF
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "12345678901"

Number of calls: 0

[Killed] BlockStatement
src/owners/owners.controller.ts:67:97
   @ApiResponse({ status: 404, description: 'Proprietário não encontrado' })
   @Roles('ADMIN', 'BROKER')
   @SkipResourceOwnerCheck()
-  async update(@Param('id') id: number, @Body() updateOwnerDto: UpdateOwnerDto): Promise<Owner> {
-    return this.ownersService.update(id, updateOwnerDto);
-  }
+  async update(@Param('id') id: number, @Body() updateOwnerDto: UpdateOwnerDto): Promise<Owner> {}
 
   @Delete(':id')
killedBy: OwnersController update should update owner successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, {"contactPhone": "(11) 99999-9999", "cpf": "37420793018", "name": "João Silva Updated"}

Number of calls: 0

[Killed] BlockStatement
src/owners/owners.controller.ts:79:56
   @HttpCode(HttpStatus.NO_CONTENT)
   @Roles('ADMIN', 'BROKER')
   @SkipResourceOwnerCheck()
-  async delete(@Param('id') id: number): Promise<void> {
-    return this.ownersService.delete(id);
-  }
+  async delete(@Param('id') id: number): Promise<void> {}
 }
killedBy: OwnersController delete should delete owner successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0
