[Killed] BlockStatement
src/owners/owners.service.ts:15:69
     private ownersRepository: Repository<Owner>,
   ) {}
 
-  async createOwner(createOwnerDto: CreateOwnerDto): Promise<Owner> {
-    const existingOwner = await this.findOwnerByCpf(createOwnerDto.cpf);
-    if (existingOwner) {
-      throw new BadRequestException('CPF já cadastrado.');
-    }
-    const owner = this.ownersRepository.create(createOwnerDto);
-    return this.ownersRepository.save(owner);
-  }
+  async createOwner(createOwnerDto: CreateOwnerDto): Promise<Owner> {}
 
   async findAll(): Promise<Owner[]> {
killedBy: OwnersService createOwner should create a new owner successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"cpf": "123.456.789-00"}}

Number of calls: 0

[Killed] ConditionalExpression
src/owners/owners.service.ts:17:9
 
   async createOwner(createOwnerDto: CreateOwnerDto): Promise<Owner> {
     const existingOwner = await this.findOwnerByCpf(createOwnerDto.cpf);
-    if (existingOwner) {
+    if (true) {
       throw new BadRequestException('CPF já cadastrado.');
     }
killedBy: OwnersService createOwner should create a new owner successfully
statusReason: BadRequestException: CPF já cadastrado.

[Killed] ConditionalExpression
src/owners/owners.service.ts:17:9
 
   async createOwner(createOwnerDto: CreateOwnerDto): Promise<Owner> {
     const existingOwner = await this.findOwnerByCpf(createOwnerDto.cpf);
-    if (existingOwner) {
+    if (false) {
       throw new BadRequestException('CPF já cadastrado.');
     }
killedBy: OwnersService createOwner should throw BadRequestException when CPF already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"contactPhone": "(11) 91234-5678", "cpf": "123.456.789-00", "name": "João da Silva", "ownerId": 1, "properties": []}

[Killed] BlockStatement
src/owners/owners.service.ts:24:37
     return this.ownersRepository.save(owner);
   }
 
-  async findAll(): Promise<Owner[]> {
-    return this.ownersRepository.find();
-  }
+  async findAll(): Promise<Owner[]> {}
 
   async findOne(id: number): Promise<Owner> {
killedBy: OwnersService findAll should return an array of owners
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/owners/owners.service.ts:28:45
     return this.ownersRepository.find();
   }
 
-  async findOne(id: number): Promise<Owner> {
-    const owner = await this.ownersRepository.findOne({ where: { ownerId: id } });
-    if (!owner) {
-      throw new NotFoundException(`Proprietário com ID ${id} não encontrado.`);
-    }
-    return owner;
-  }
+  async findOne(id: number): Promise<Owner> {}
 
   async findByCpf(cpf: string): Promise<Owner> {
killedBy: OwnersService findOne should return an owner when found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"ownerId": 1}}

Number of calls: 0

[Killed] BooleanLiteral
src/owners/owners.service.ts:30:9
 
   async findOne(id: number): Promise<Owner> {
     const owner = await this.ownersRepository.findOne({ where: { ownerId: id } });
-    if (!owner) {
+    if (owner) {
       throw new NotFoundException(`Proprietário com ID ${id} não encontrado.`);
     }
killedBy: OwnersService findOne should return an owner when found
statusReason: NotFoundException: Proprietário com ID 1 não encontrado.

[Killed] ConditionalExpression
src/owners/owners.service.ts:30:9
 
   async findOne(id: number): Promise<Owner> {
     const owner = await this.ownersRepository.findOne({ where: { ownerId: id } });
-    if (!owner) {
+    if (false) {
       throw new NotFoundException(`Proprietário com ID ${id} não encontrado.`);
     }
killedBy: OwnersService findOne should throw NotFoundException when owner not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] StringLiteral
src/owners/owners.service.ts:31:35
   async findOne(id: number): Promise<Owner> {
     const owner = await this.ownersRepository.findOne({ where: { ownerId: id } });
     if (!owner) {
-      throw new NotFoundException(`Proprietário com ID ${id} não encontrado.`);
+      throw new NotFoundException(``);
     }
     return owner;
killedBy: OwnersService findOne should throw NotFoundException when owner not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Proprietário com ID 1 não encontrado."
Received message: "Not Found"

       97 |         } else {
       98 |           stryCov_9fa48("45");
    >  99 |           throw new NotFoundException(stryMutAct_9fa48("46") ? `` : (stryCov_9fa48("46"), `Proprietário com ID ${id} não encontrado.`));

[Killed] BlockStatement
src/owners/owners.service.ts:36:48
     return owner;
   }
 
-  async findByCpf(cpf: string): Promise<Owner> {
-    const owner = await this.findOwnerByCpf(cpf);
-    if (!owner) {
-      throw new NotFoundException(`Proprietário com CPF ${cpf} não encontrado.`);
-    }
-    return owner;
-  }
+  async findByCpf(cpf: string): Promise<Owner> {}
 
   // Método privado para buscar sem lançar exceção
killedBy: OwnersService findByCpf should return an owner when found by CPF
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"cpf": "123.456.789-00"}}

Number of calls: 0

[Killed] BooleanLiteral
src/owners/owners.service.ts:38:9
 
   async findByCpf(cpf: string): Promise<Owner> {
     const owner = await this.findOwnerByCpf(cpf);
-    if (!owner) {
+    if (owner) {
       throw new NotFoundException(`Proprietário com CPF ${cpf} não encontrado.`);
     }
killedBy: OwnersService findByCpf should return an owner when found by CPF
statusReason: NotFoundException: Proprietário com CPF 123.456.789-00 não encontrado.

[Killed] ConditionalExpression
src/owners/owners.service.ts:38:9
 
   async findByCpf(cpf: string): Promise<Owner> {
     const owner = await this.findOwnerByCpf(cpf);
-    if (!owner) {
+    if (false) {
       throw new NotFoundException(`Proprietário com CPF ${cpf} não encontrado.`);
     }
killedBy: OwnersService findByCpf should throw NotFoundException when owner not found by CPF
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/owners/owners.service.ts:45:68
   }
 
   // Método privado para buscar sem lançar exceção
-  private async findOwnerByCpf(cpf: string): Promise<Owner | null> {
-    return this.ownersRepository.findOne({ where: { cpf } });
-  }
+  private async findOwnerByCpf(cpf: string): Promise<Owner | null> {}
 
   async update(id: number, updateOwnerDto: UpdateOwnerDto): Promise<Owner> {
killedBy: OwnersService createOwner should create a new owner successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"cpf": "123.456.789-00"}}

Number of calls: 0

[Killed] BlockStatement
src/owners/owners.service.ts:49:76
     return this.ownersRepository.findOne({ where: { cpf } });
   }
 
-  async update(id: number, updateOwnerDto: UpdateOwnerDto): Promise<Owner> {
-    const owner = await this.findOne(id);
-    
-    if (updateOwnerDto.cpf) {
-      const existingOwner = await this.findOwnerByCpf(updateOwnerDto.cpf);
-      if (existingOwner && existingOwner.ownerId !== id) {
-        throw new BadRequestException('CPF já cadastrado.');
-      }
-    }
-    
-    const updatedOwner = this.ownersRepository.merge(owner, updateOwnerDto);
-    return this.ownersRepository.save(updatedOwner);
-  }
+  async update(id: number, updateOwnerDto: UpdateOwnerDto): Promise<Owner> {}
 
   async delete(id: number): Promise<void> {
killedBy: OwnersService update should update an owner successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"ownerId": 1}}

Number of calls: 0

[Killed] BlockStatement
src/owners/owners.service.ts:52:29
   async update(id: number, updateOwnerDto: UpdateOwnerDto): Promise<Owner> {
     const owner = await this.findOne(id);
     
-    if (updateOwnerDto.cpf) {
-      const existingOwner = await this.findOwnerByCpf(updateOwnerDto.cpf);
-      if (existingOwner && existingOwner.ownerId !== id) {
-        throw new BadRequestException('CPF já cadastrado.');
-      }
-    }
+    if (updateOwnerDto.cpf) {}
     
     const updatedOwner = this.ownersRepository.merge(owner, updateOwnerDto);
killedBy: OwnersService update should update an owner successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "where": Object {
-     "cpf": "987.654.321-00",

[Killed] ConditionalExpression
src/owners/owners.service.ts:52:9
   async update(id: number, updateOwnerDto: UpdateOwnerDto): Promise<Owner> {
     const owner = await this.findOne(id);
     
-    if (updateOwnerDto.cpf) {
+    if (false) {
       const existingOwner = await this.findOwnerByCpf(updateOwnerDto.cpf);
       if (existingOwner && existingOwner.ownerId !== id) {
killedBy: OwnersService update should update an owner successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "where": Object {
-     "cpf": "987.654.321-00",

[Killed] ConditionalExpression
src/owners/owners.service.ts:54:28
     
     if (updateOwnerDto.cpf) {
       const existingOwner = await this.findOwnerByCpf(updateOwnerDto.cpf);
-      if (existingOwner && existingOwner.ownerId !== id) {
+      if (existingOwner && true) {
         throw new BadRequestException('CPF já cadastrado.');
       }
killedBy: OwnersService update should update owner when CPF belongs to the same owner
statusReason: BadRequestException: CPF já cadastrado.

[Killed] LogicalOperator
src/owners/owners.service.ts:54:11
     
     if (updateOwnerDto.cpf) {
       const existingOwner = await this.findOwnerByCpf(updateOwnerDto.cpf);
-      if (existingOwner && existingOwner.ownerId !== id) {
+      if (existingOwner || existingOwner.ownerId !== id) {
         throw new BadRequestException('CPF já cadastrado.');
       }
killedBy: OwnersService update should update an owner successfully
statusReason: TypeError: Cannot read properties of null (reading 'ownerId')

[Killed] BlockStatement
src/owners/owners.service.ts:63:43
     return this.ownersRepository.save(updatedOwner);
   }
 
-  async delete(id: number): Promise<void> {
-    const result = await this.ownersRepository.delete(id);
-    if (result.affected === 0) {
-      throw new NotFoundException(`Proprietário com ID ${id} não encontrado.`);
-    }
-  }
+  async delete(id: number): Promise<void> {}
 }
killedBy: OwnersService delete should delete an owner successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ConditionalExpression
src/owners/owners.service.ts:65:9
 
   async delete(id: number): Promise<void> {
     const result = await this.ownersRepository.delete(id);
-    if (result.affected === 0) {
+    if (true) {
       throw new NotFoundException(`Proprietário com ID ${id} não encontrado.`);
     }
killedBy: OwnersService delete should delete an owner successfully
statusReason: NotFoundException: Proprietário com ID 1 não encontrado.

[Killed] BlockStatement
src/owners/owners.service.ts:65:32
 
   async delete(id: number): Promise<void> {
     const result = await this.ownersRepository.delete(id);
-    if (result.affected === 0) {
-      throw new NotFoundException(`Proprietário com ID ${id} não encontrado.`);
-    }
+    if (result.affected === 0) {}
   }
 }
killedBy: OwnersService delete should throw NotFoundException when owner to delete not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
