[Killed] BlockStatement
src/users/users.controller.ts:56:80
   @ApiBadRequestResponse({ description: 'Dados inválidos fornecidos.' })
   @ApiUnauthorizedResponse({ description: 'Token de acesso inválido ou expirado.' })
   @ApiForbiddenResponse({ description: 'Apenas administradores podem criar usuários.' })
-  async create(@Body() createUserDto: CreateUserDto): Promise<UserResponseDto> {
-    const user = await this.usersService.create(createUserDto);
-    const { password, tokenVersion, ...result } = user;
-    return result;
-  }
+  async create(@Body() createUserDto: CreateUserDto): Promise<UserResponseDto> {}
 
   @Get()
killedBy: UsersController create should create a new user and return user response dto
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"birthDate": "15-07-1990", "email": "test@example.com", "name": "Test User", "password": "password123", "phone": "+5511999999999", "role": "ADMIN"}

Number of calls: 0

[Killed] BlockStatement
src/users/users.controller.ts:76:47
   })
   @ApiUnauthorizedResponse({ description: 'Token de acesso inválido ou expirado.' })
   @ApiForbiddenResponse({ description: 'Apenas administradores podem listar todos os usuários.' })
-  async findAll(): Promise<UserResponseDto[]> {
-    const users = await this.usersService.findAll();
-    return users.map(user => {
-      const { password, tokenVersion, ...result } = user;
-      return result;
-    });
-  }
+  async findAll(): Promise<UserResponseDto[]> {}
 
   @Get('profile')
killedBy: UsersController findAll should return an array of users as user response dtos
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/users/users.controller.ts:78:30
   @ApiForbiddenResponse({ description: 'Apenas administradores podem listar todos os usuários.' })
   async findAll(): Promise<UserResponseDto[]> {
     const users = await this.usersService.findAll();
-    return users.map(user => {
-      const { password, tokenVersion, ...result } = user;
-      return result;
-    });
+    return users.map(user => {});
   }
 
killedBy: UsersController findAll should return an array of users as user response dtos
statusReason: TypeError: Cannot read properties of undefined (reading 'userId')

[Killed] BlockStatement
src/users/users.controller.ts:97:62
     type: UserResponseDto
   })
   @ApiUnauthorizedResponse({ description: 'Token de acesso inválido ou expirado.' })
-  async getProfile(@Request() req): Promise<UserResponseDto> {
-    const user = await this.usersService.findById(req.user.userId);
-    if (!user) {
-      throw new Error(`Usuário com ID ${req.user.userId} não encontrado.`);
-    }
-    const { password, tokenVersion, ...result } = user;
-    return result;
-  }
+  async getProfile(@Request() req): Promise<UserResponseDto> {}
 
   @Get(':userId')
killedBy: UsersController getProfile should return the current user profile as user response dto
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ConditionalExpression
src/users/users.controller.ts:99:9
   @ApiUnauthorizedResponse({ description: 'Token de acesso inválido ou expirado.' })
   async getProfile(@Request() req): Promise<UserResponseDto> {
     const user = await this.usersService.findById(req.user.userId);
-    if (!user) {
+    if (false) {
       throw new Error(`Usuário com ID ${req.user.userId} não encontrado.`);
     }
killedBy: UsersController getProfile should throw an error if the user is not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Usuário com ID 999 não encontrado."
Received: "Cannot destructure property 'password' of 'user' as it is null."

[Killed] BooleanLiteral
src/users/users.controller.ts:99:9
   @ApiUnauthorizedResponse({ description: 'Token de acesso inválido ou expirado.' })
   async getProfile(@Request() req): Promise<UserResponseDto> {
     const user = await this.usersService.findById(req.user.userId);
-    if (!user) {
+    if (user) {
       throw new Error(`Usuário com ID ${req.user.userId} não encontrado.`);
     }
killedBy: UsersController getProfile should return the current user profile as user response dto
statusReason: Error: Usuário com ID 1 não encontrado.

[Killed] BlockStatement
src/users/users.controller.ts:121:90
   @ApiNotFoundResponse({ description: 'Usuário não encontrado.' })
   @ApiUnauthorizedResponse({ description: 'Token de acesso inválido ou expirado.' })
   @ApiForbiddenResponse({ description: 'Você não tem permissão para acessar este recurso.' })
-  async findOne(@Param('userId', ParseIntPipe) userId: number): Promise<UserResponseDto> {
-    const user = await this.usersService.findById(userId);
-    if (!user) {
-      throw new Error(`Usuário com ID ${userId} não encontrado.`);
-    }
-    const { password, tokenVersion, ...result } = user;
-    return result;
-  }
+  async findOne(@Param('userId', ParseIntPipe) userId: number): Promise<UserResponseDto> {}
 
   @Patch(':userId')
killedBy: UsersController findOne should return a user by ID as user response dto
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/users/users.controller.ts:123:16
   @ApiForbiddenResponse({ description: 'Você não tem permissão para acessar este recurso.' })
   async findOne(@Param('userId', ParseIntPipe) userId: number): Promise<UserResponseDto> {
     const user = await this.usersService.findById(userId);
-    if (!user) {
-      throw new Error(`Usuário com ID ${userId} não encontrado.`);
-    }
+    if (!user) {}
     const { password, tokenVersion, ...result } = user;
     return result;
killedBy: UsersController findOne should throw an error if the user is not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Usuário com ID 999 não encontrado."
Received: "Cannot destructure property 'password' of 'user' as it is null."

[Killed] ConditionalExpression
src/users/users.controller.ts:123:9
   @ApiForbiddenResponse({ description: 'Você não tem permissão para acessar este recurso.' })
   async findOne(@Param('userId', ParseIntPipe) userId: number): Promise<UserResponseDto> {
     const user = await this.usersService.findById(userId);
-    if (!user) {
+    if (true) {
       throw new Error(`Usuário com ID ${userId} não encontrado.`);
     }
killedBy: UsersController findOne should return a user by ID as user response dto
statusReason: Error: Usuário com ID 1 não encontrado.

[Killed] StringLiteral
src/users/users.controller.ts:124:23
   async findOne(@Param('userId', ParseIntPipe) userId: number): Promise<UserResponseDto> {
     const user = await this.usersService.findById(userId);
     if (!user) {
-      throw new Error(`Usuário com ID ${userId} não encontrado.`);
+      throw new Error(``);
     }
     const { password, tokenVersion, ...result } = user;
killedBy: UsersController findOne should throw an error if the user is not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Usuário com ID 999 não encontrado."
Received: ""

[Killed] BlockStatement
src/users/users.controller.ts:149:31
   async update(
     @Param('userId', ParseIntPipe) userId: number,
     @Body() updateUserDto: UpdateUserDto,
-  ): Promise<UserResponseDto> {
-    const dto = { ...updateUserDto } as any;
-    if (dto.birthDate && typeof dto.birthDate === 'string') {
-      dto.birthDate = new Date(dto.birthDate);
-    }
-    const user = await this.usersService.update(userId, dto);
-    const { password, tokenVersion, ...result } = user;
-    return result;
-  }
+  ): Promise<UserResponseDto> {}
 
   @Delete(':userId')
killedBy: UsersController update should update and return a user as user response dto
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, {"name": "Updated Name"}

Number of calls: 0

[Killed] EqualityOperator
src/users/users.controller.ts:151:26
     @Body() updateUserDto: UpdateUserDto,
   ): Promise<UserResponseDto> {
     const dto = { ...updateUserDto } as any;
-    if (dto.birthDate && typeof dto.birthDate === 'string') {
+    if (dto.birthDate && typeof dto.birthDate !== 'string') {
       dto.birthDate = new Date(dto.birthDate);
     }
killedBy: UsersController update should convert birthDate string to Date object before updating
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, ObjectContaining {"birthDate": Any<Date>, "name": "Updated Name"}
Received: 1, {"birthDate": "15-07-1990", "name": "Updated Name"}

Number of calls: 1

[Killed] ConditionalExpression
src/users/users.controller.ts:151:9
     @Body() updateUserDto: UpdateUserDto,
   ): Promise<UserResponseDto> {
     const dto = { ...updateUserDto } as any;
-    if (dto.birthDate && typeof dto.birthDate === 'string') {
+    if (true) {
       dto.birthDate = new Date(dto.birthDate);
     }
killedBy: UsersController update should update and return a user as user response dto
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  1,
  Object {
+   "birthDate": Date { NaN },

[Killed] BlockStatement
src/users/users.controller.ts:174:78
   @ApiNotFoundResponse({ description: 'Usuário não encontrado.' })
   @ApiUnauthorizedResponse({ description: 'Token de acesso inválido ou expirado.' })
   @ApiForbiddenResponse({ description: 'Você não tem permissão para acessar este recurso.' })
-  async remove(@Param('userId', ParseIntPipe) userId: number): Promise<void> {
-    await this.usersService.delete(userId);
-  }
+  async remove(@Param('userId', ParseIntPipe) userId: number): Promise<void> {}
 }
killedBy: UsersController remove should call the service delete method
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0
