[Killed] BlockStatement
src/users/users.service.ts:15:70
     private readonly userRepository: Repository<User>
   ) {}
 
-  async findByEmailWithPassword(email: string): Promise<User | null> {
-    return this.userRepository
-      .createQueryBuilder('user')
-      .where('user.email = :email', { email })
-      .addSelect('user.password')
-      .addSelect('user.tokenVersion')
-      .getOne();
-  }
+  async findByEmailWithPassword(email: string): Promise<User | null> {}
 
   async findById(userId: number): Promise<User | null> {
killedBy: UsersService findByEmailWithPassword should return a user with password and token version
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user"

Number of calls: 0

[Killed] ObjectLiteral
src/users/users.service.ts:18:37
   async findByEmailWithPassword(email: string): Promise<User | null> {
     return this.userRepository
       .createQueryBuilder('user')
-      .where('user.email = :email', { email })
+      .where('user.email = :email', {})
       .addSelect('user.password')
       .addSelect('user.tokenVersion')
killedBy: UsersService findByEmailWithPassword should return a user with password and token version
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user.email = :email",
- Object {
-   "email": "test@example.com",

[Killed] StringLiteral
src/users/users.service.ts:18:14
   async findByEmailWithPassword(email: string): Promise<User | null> {
     return this.userRepository
       .createQueryBuilder('user')
-      .where('user.email = :email', { email })
+      .where("", { email })
       .addSelect('user.password')
       .addSelect('user.tokenVersion')
killedBy: UsersService findByEmailWithPassword should return a user with password and token version
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "user.email = :email",
+ "",
  {"email": "test@example.com"},

[Killed] BlockStatement
src/users/users.service.ts:24:56
       .getOne();
   }
 
-  async findById(userId: number): Promise<User | null> {
-    return this.userRepository
-      .createQueryBuilder('user')
-      .where('user.userId = :userId', { userId })
-      .addSelect('user.tokenVersion')
-      .getOne();
-  }
+  async findById(userId: number): Promise<User | null> {}
 
   async incrementTokenVersion(userId: number): Promise<void> {
killedBy: UsersService findById should return a user by id with token version
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user"

Number of calls: 0

[Killed] ObjectLiteral
src/users/users.service.ts:27:39
   async findById(userId: number): Promise<User | null> {
     return this.userRepository
       .createQueryBuilder('user')
-      .where('user.userId = :userId', { userId })
+      .where('user.userId = :userId', {})
       .addSelect('user.tokenVersion')
       .getOne();
killedBy: UsersService findById should return a user by id with token version
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user.userId = :userId",
- Object {
-   "userId": 1,

[Killed] BlockStatement
src/users/users.service.ts:32:62
       .getOne();
   }
 
-  async incrementTokenVersion(userId: number): Promise<void> {
-    await this.userRepository.increment({ userId }, 'tokenVersion', 1);
-  }
+  async incrementTokenVersion(userId: number): Promise<void> {}
 
   async findByPhone(phone: string): Promise<User | null> {
killedBy: UsersService incrementTokenVersion should increment the token version by 1
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"userId": 1}, "tokenVersion", 1

Number of calls: 0

[Killed] ObjectLiteral
src/users/users.service.ts:33:41
   }
 
   async incrementTokenVersion(userId: number): Promise<void> {
-    await this.userRepository.increment({ userId }, 'tokenVersion', 1);
+    await this.userRepository.increment({}, 'tokenVersion', 1);
   }
 
killedBy: UsersService incrementTokenVersion should increment the token version by 1
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "userId": 1,
- }

[Killed] BlockStatement
src/users/users.service.ts:36:58
     await this.userRepository.increment({ userId }, 'tokenVersion', 1);
   }
 
-  async findByPhone(phone: string): Promise<User | null> {
-    return this.userRepository.findOne({
-      where: { phone },
-    });
-  }
+  async findByPhone(phone: string): Promise<User | null> {}
 
   async update(userId: number, updateUserDto: UpdateUserDto): Promise<User> {
killedBy: UsersService findByPhone should return a user by phone number
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"phone": "+5511999999999"}}

Number of calls: 0

[Killed] BlockStatement
src/users/users.service.ts:42:77
     });
   }
 
-  async update(userId: number, updateUserDto: UpdateUserDto): Promise<User> {
-    const user = await this.findById(userId);
-    if (!user) {
-      throw new NotFoundException(`Usuário com ID ${userId} não encontrado.`);
-    }
-    const updatedUser = this.userRepository.merge(user, updateUserDto);
-    return this.userRepository.save(updatedUser);
-  }
+  async update(userId: number, updateUserDto: UpdateUserDto): Promise<User> {}
 
   async findByEmail(email: string): Promise<User | null> {
killedBy: UsersService update should update and return a user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BooleanLiteral
src/users/users.service.ts:44:9
 
   async update(userId: number, updateUserDto: UpdateUserDto): Promise<User> {
     const user = await this.findById(userId);
-    if (!user) {
+    if (user) {
       throw new NotFoundException(`Usuário com ID ${userId} não encontrado.`);
     }
killedBy: UsersService update should update and return a user
statusReason: NotFoundException: Usuário com ID 1 não encontrado.

[Killed] ConditionalExpression
src/users/users.service.ts:44:9
 
   async update(userId: number, updateUserDto: UpdateUserDto): Promise<User> {
     const user = await this.findById(userId);
-    if (!user) {
+    if (false) {
       throw new NotFoundException(`Usuário com ID ${userId} não encontrado.`);
     }
killedBy: UsersService update should throw NotFoundException with correct message when user does not exist
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: NotFoundException
Received constructor: ReferenceError

[Killed] BlockStatement
src/users/users.service.ts:51:58
     return this.userRepository.save(updatedUser);
   }
 
-  async findByEmail(email: string): Promise<User | null> {
-    return this.userRepository.findOne({
-      where: { email },
-    });
-  }
+  async findByEmail(email: string): Promise<User | null> {}
 
   async create(user: RegisterRequestDto): Promise<User> {
killedBy: UsersService findByEmail should return a user by email
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"email": "test@example.com"}}

Number of calls: 0

[Killed] ObjectLiteral
src/users/users.service.ts:52:40
   }
 
   async findByEmail(email: string): Promise<User | null> {
-    return this.userRepository.findOne({
-      where: { email },
-    });
+    return this.userRepository.findOne({});
   }
 
killedBy: UsersService findByEmail should return a user by email
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "email": "test@example.com",

[Killed] BlockStatement
src/users/users.service.ts:57:57
     });
   }
 
-  async create(user: RegisterRequestDto): Promise<User> {
-    const newUser = this.userRepository.create(user);
-    return this.userRepository.save(newUser);
-  }
+  async create(user: RegisterRequestDto): Promise<User> {}
 
   async delete(userId: number): Promise<void> {
killedBy: UsersService create should create and return a new user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"birthDate": "15-07-1990", "email": "test@example.com", "name": "Test User", "password": "password123", "phone": "+5511999999999"}

Number of calls: 0

[Killed] BlockStatement
src/users/users.service.ts:62:47
     return this.userRepository.save(newUser);
   }
 
-  async delete(userId: number): Promise<void> {
-    const result = await this.userRepository.delete(userId);
-    if (result.affected === 0) {
-      throw new NotFoundException(`Usuário com ID ${userId} não encontrado.`);
-    }
-  }
+  async delete(userId: number): Promise<void> {}
 
   async findAll(): Promise<User[]> {
killedBy: UsersService delete should delete a user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ConditionalExpression
src/users/users.service.ts:64:9
 
   async delete(userId: number): Promise<void> {
     const result = await this.userRepository.delete(userId);
-    if (result.affected === 0) {
+    if (false) {
       throw new NotFoundException(`Usuário com ID ${userId} não encontrado.`);
     }
killedBy: UsersService delete should throw NotFoundException with correct message when user to delete does not exist
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: NotFoundException
Received constructor: ReferenceError

[Killed] BlockStatement
src/users/users.service.ts:64:32
 
   async delete(userId: number): Promise<void> {
     const result = await this.userRepository.delete(userId);
-    if (result.affected === 0) {
-      throw new NotFoundException(`Usuário com ID ${userId} não encontrado.`);
-    }
+    if (result.affected === 0) {}
   }
 
killedBy: UsersService delete should throw NotFoundException with correct message when user to delete does not exist
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: NotFoundException
Received constructor: ReferenceError

[Killed] BlockStatement
src/users/users.service.ts:69:36
     }
   }
 
-  async findAll(): Promise<User[]> {
-    return this.userRepository.find();
-  }
+  async findAll(): Promise<User[]> {}
 }
killedBy: UsersService findAll should return an array of users
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
